# Eleman İşlemleri(4) #

In [7]:
import numpy as np
import pandas as pd
e1=np.random.randint(10,size=5)
e2=np.random.randint(10,size=5)
e3=np.random.randint(10,size=5)

In [3]:
sozluk={"sutun1" :e1,"sutun2":e2,"sutun3":e3}

In [4]:
sozluk

{'sutun1': array([7, 0, 5, 3, 2]),
 'sutun2': array([2, 1, 9, 3, 9]),
 'sutun3': array([6, 5, 4, 4, 8])}

In [8]:
df= pd.DataFrame(sozluk)

In [9]:
df

   sutun1  sutun2  sutun3
0       7       2       6
1       0       1       5
2       5       9       4
3       3       3       4
4       2       9       8

In [10]:
df[0:1] #---> Sıfırdan bire kadar olanları al.

   sutun1  sutun2  sutun3
0       7       2       6

In [11]:
df.index #--> 0 dan başlıyor. 5 e kadar gidiyor. Birer artıyor.

RangeIndex(start=0, stop=5, step=1)

In [12]:
df

   sutun1  sutun2  sutun3
0       7       2       6
1       0       1       5
2       5       9       4
3       3       3       4
4       2       9       8

İndexleri değiştirmek isteyelim.

In [15]:
df.index=["a","b","c","d","e"]

In [16]:
df

   sutun1  sutun2  sutun3
a       7       2       6
b       0       1       5
c       5       9       4
d       3       3       4
e       2       9       8

In [18]:
df["c":"e"] # Burada c den başla e doğru git anlaımında diyoruz.

   sutun1  sutun2  sutun3
c       5       9       4
d       3       3       4
e       2       9       8

In [ ]:
Örneğin bir tablo silmek isteyelim.

In [19]:
df.drop("a",axis=0) #--> a satırını sil demek istiyoruz. (axis=0 dersek satır)

   sutun1  sutun2  sutun3
b       0       1       5
c       5       9       4
d       3       3       4
e       2       9       8

In [22]:
df.drop("sutun1",axis=1) #--> Burada sütun siliyoruz. (axis=1 dersek sütun)

   sutun2  sutun3
a       2       6
b       1       5
c       9       4
d       3       4
e       9       8

Fonksiyonu tekrar çağıralım.

In [23]:
df

   sutun1  sutun2  sutun3
a       7       2       6
b       0       1       5
c       5       9       4
d       3       3       4
e       2       9       8

Görüldüğü üzere silme işlemleri yapmamıza rağmen aynı şekilde karşımıza çıkmaktadır.
Şu şekilde uygularsak silme işlemini kalıcı hale getirebiliriz.

In [24]:
df.drop("a",axis=0,inplace=True)

In [25]:
df

   sutun1  sutun2  sutun3
b       0       1       5
c       5       9       4
d       3       3       4
e       2       9       8

Görüldüğü üzere fonksiyonu çağırdığımızda  inplace=True kullandığımızda kalıcı hale gelir.

Şimdi ise toplu silme işlemini kısa yoldan nasıl yapabiliriz.İnceleyelim.

In [26]:
g=["b","d"]

In [27]:
g

['b', 'd']

In [28]:
df.drop(g,axis=0) #--> Toplu olarak atama yaptık ve içine atadık.

   sutun1  sutun2  sutun3
c       5       9       4
e       2       9       8

In [29]:
df

   sutun1  sutun2  sutun3
b       0       1       5
c       5       9       4
d       3       3       4
e       2       9       8

inplace= True olarak yapmadığımız için tablomuz eski haline dönüş yaptı.

In [30]:
"sutun1" in df

True

In [31]:
h=["sutun1","sutun2","sutun4"]

Bir döngü yardımıyla doğrululuklarını bulalım.

In [33]:
for i in h:
    print(i in df) #--> H df içinde döndür.Doğruluk değerleri yazdır.

True
True
False

In [34]:
df

   sutun1  sutun2  sutun3
b       0       1       5
c       5       9       4
d       3       3       4
e       2       9       8

Tablomuzu tekrar getirelim.Yeni bir sutun eklemeye çalışalım.

In [36]:
df["sutun4"]=df["sutun3"] /df["sutun2"]

In [37]:
df

   sutun1  sutun2  sutun3    sutun4
b       0       1       5  5.000000
c       5       9       4  0.444444
d       3       3       4  1.333333
e       2       9       8  0.888889

Şİmdi ise alıştırma olması açısından sutun4 tekrar silelim.

In [38]:
df.drop("sutun4",axis=1) #-->Sütunu silmeye çalışıyoruz.(axis=1)

   sutun1  sutun2  sutun3
b       0       1       5
c       5       9       4
d       3       3       4
e       2       9       8

In [39]:
df

   sutun1  sutun2  sutun3    sutun4
b       0       1       5  5.000000
c       5       9       4  0.444444
d       3       3       4  1.333333
e       2       9       8  0.888889

Ama yine tekrar geldi.Çünkü inplace=True fonksiyonunu kullanmadık.

In [40]:
df.drop("sutun4",axis=1,inplace=True)

In [41]:
df

   sutun1  sutun2  sutun3
b       0       1       5
c       5       9       4
d       3       3       4
e       2       9       8

In [42]:
df

   sutun1  sutun2  sutun3
b       0       1       5
c       5       9       4
d       3       3       4
e       2       9       8

Şimdi ise kalıcı olarak silinmiştir.